#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет сообщение в очередь.
//
// Параметры:
//   ДвоичныеДанныеСообщения - ДвоичныеДанные - данные сообщения.
//   Идентификатор - УникальныйИдентификатор - идентификатор сообщения;
//
Процедура ДобавитьСообщение(ДвоичныеДанныеСообщения, Идентификатор = Неопределено) Экспорт
	
	Менеджер = РегистрыСведений.ОчередьСообщенийВ1СДокументооборот.СоздатьМенеджерЗаписи();
	
	Менеджер.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Менеджер.Данные = Новый ХранилищеЗначения(ДвоичныеДанныеСообщения, Новый СжатиеДанных(9));
	Менеджер.ДатаСоздания = ТекущаяДатаСеанса();
	
	Если Идентификатор = Неопределено Тогда
		Менеджер.Идентификатор = Новый УникальныйИдентификатор();
	Иначе
		Менеджер.Идентификатор = Идентификатор;
	КонецЕсли;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли