
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладскиеЯчейки.Ссылка КАК Ячейка
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|ГДЕ
		|	СкладскиеЯчейки.Владелец = &Склад
		|	И СкладскиеЯчейки.ТипСкладскойЯчейки = &ТипСкладскойЯчейки";
	
	Запрос.УстановитьПараметр("Склад", Параметры.Склад);
	Запрос.УстановитьПараметр("ТипСкладскойЯчейки", Перечисления.ТипыСкладскихЯчеек.Хранение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Сч = 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Ячейки.Добавить();
		НоваяСтрока.Ячейка = ВыборкаДетальныеЗаписи.Ячейка;
		НоваяСтрока.Количество = 4 * Сч;
		НоваяСтрока.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("пара (1 пара)");
		
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЯчейки

&НаКлиенте
Процедура ЯчейкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	Закрыть(Элемент.ТекущиеДанные.Ячейка);
	
КонецПроцедуры

#КонецОбласти
