
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
// Параметры:
//  ДрайвераОборудования - ТаблицаЗначений - см. МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования()
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверГексагонТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Гексагон:Терминалы сбора данных Goods'");
	Драйвер.ИдентификаторОбъекта = "ProtonTSD"; 
	Драйвер.ВерсияДрайвера = "8.4.2"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверКлеверенсТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Клеверенс:Терминалы сбора данных'");
	Драйвер.ИдентификаторОбъекта = "Cleverence.TO_TSD"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверАтолТерминалыСбораДанныхMobileLogistics";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:Терминалы сбора данных Mobile Logistics 8.Х'");
	Драйвер.ИдентификаторОбъекта = "PDX1C_Int"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверRightScanТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Right Scan:Терминалы сбора данных (ПО RS:Mobile ACS)'");
	Драйвер.ИдентификаторОбъекта = "RSExchange"; 
	Драйвер.ВерсияДрайвера = "2.68"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодТерминалыСбораДанныхNative";
	Драйвер.Наименование = НСтр("ru = 'Сканкод:Терминалы сбора данных Cipher LAB 8x00 (Native Api)'");
	Драйвер.ИдентификаторОбъекта = "CipherLab8"; 
	Драйвер.ВерсияДрайвера = "1.0.0.9"; 
	Драйвер.СнятСПоддержки = Истина;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодТерминалыСбораДанныхCipherLab8G2";
	Драйвер.Наименование = НСтр("ru = 'Сканкод:Терминалы сбора данных Cipher Lab 8 G2'");
	Драйвер.ИдентификаторОбъекта = "CipherLab8G2"; 
	Драйвер.ВерсияДрайвера = "2.0.0.24"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиТерминалСбораДанныхCitySoftBusiness";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Терминал сбора данных City-Soft Business'");
	Драйвер.ИдентификаторОбъекта = "CitySoftBusinessDriver"; 
	Драйвер.ВерсияДрайвера = "4.0.12.747"; 
	Драйвер.СнятСПоддержки = Истина;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиТерминалСбораДанныхCitySoftLite";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Терминал сбора данных City-Soft Lite'");
	Драйвер.ИдентификаторОбъекта = "CitySoftLiteEquipmentDriver"; 
	Драйвер.ВерсияДрайвера = "5.8.3.260"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиТерминалСбораДанныхCitySoftStandart";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Терминал сбора данных City-Soft Standart'");
	Драйвер.ИдентификаторОбъекта = "CitySoftStandartDriver"; 
	Драйвер.ВерсияДрайвера = "4.5.0.881"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверХарвестрТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Харвестр:Приложение сбора данных'");
	Драйвер.ИдентификаторОбъекта = "HarvesterEquipmentNative"; 
	Драйвер.ВерсияДрайвера = "1.2.3.8";   
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканпортТерминалСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Сканпорт:Терминал сбора данных'");
	Драйвер.ИдентификаторОбъекта = "DmTsdDriver"; 
	Драйвер.ВерсияДрайвера = "1.0.1"; 
	
КонецПроцедуры

#КонецОбласти