///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Пустая структура для выполнения операции взаимодействия с сервером НСПК
// 
// Возвращаемое значение:
//   Структура:
//   * АдресСервера - Строка - Endpoint
//   * КлючДоступа - Строка - APIKey
//   * КлючКассы - Строка - MACKey
//
Функция ПараметрыОперацииНСПК() Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("АдресСервера"); // Endpoint
	Параметры.Вставить("КлючДоступа");  // APIKey
	Параметры.Вставить("КлючКассы");    // MACKey
	Параметры.Вставить("ПроверятьКорневыеСертификаты", Истина); // Булево - Проверка корневого сертификата сервера НСПК
	Параметры.Вставить("ИдентификаторЗапроса"); // Строка - Уникальный идентификатор запроса (нужно генерировать на прикладном коде в формате uuid).
	Параметры.Вставить("ИдентификаторКассы"); // Строка - Идентификатор кассы.
	Параметры.Вставить("ХешНомерКарты"); // Строка - Хешированный PAN карты.   
	Параметры.Вставить("СсылкаНаПлатежныйСчет"); // Строка - Payment Account Reference, Уникальный идентификатор для токенезированных (виртуальных) карт  связанный с PAN конкретного держателя карты.  

	Параметры.Вставить("ИдентификаторКорзины"); // Строка - Идентификатор корзины.
	Параметры.Вставить("ТоварныеПозиции", Новый Массив()); // Массив - Структур - ПараметрыТоварнойПозиции() 
	
	Параметры.Вставить("НомерФискальногоНакопителя"); // Строка - Заводской номер фискального накопителя
	Параметры.Вставить("ФискальныйТипРасчета", ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств")); // Перечисление.ТипыРасчетаДенежнымиСредствами - Признак расчета
	Параметры.Вставить("ФискальныйПризнакЧека"); // Строка - Фискальный признак документа
	Параметры.Вставить("ФискальныйЧекНомер"); // Строка - Порядковый номер фискального документа
	Параметры.Вставить("ФискальныйЧекДатаВремя"); // ДатаВремя - Дата и время осуществления расчета
	Параметры.Вставить("ФискальныйЧекСумма"); // Число - Сумма расчета
	Параметры.Вставить("ФискальныйМестоРасчетов"); // Строка - Место расчетов 
	
	Параметры.Вставить("QRКодЧекаККТ"); // Строка - QR код чека ККТ 
	Параметры.Вставить("ОснованиеФискальнойОперации"); // Ссылка - ОснованиеФискальнойОперацииБПО
	
	Возврат Параметры; 
	
КонецФункции

// Пустая структура для параметров товарной позиции
// 
// Возвращаемое значение:
//   Структура:
//   * НомерПозиции - Строка - Порядковый номер позиции в корзине начиная с 1
//   * Артикул - Строка - Артикул товара
//   * КодТовараТРУ - Строка - Полный код товара, согласованный с перечнем ТРУ
//   * Количество - Число - Количество единиц товара
//   * Цена - Число - Цена за единицу товара в рублях
//   * Сертификаты - Массив из см.ЭлектронныеСертификатыНСПК.ПараметрыСертификата
//
Функция ПараметрыТоварнойПозиции() Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("НомерПозиции"); // Порядковый номер позиции в корзине начиная с 1
	Параметры.Вставить("НомерПозицииВозврата"); // Порядковый номер позиции в корзине покупки, которая содержит возвращаемый товар
	Параметры.Вставить("Артикул");      // Артикул товара
	Параметры.Вставить("КодТовараТРУ"); // Полный код товара, согласованный с перечнем ТРУ
	Параметры.Вставить("Количество");   // Количество единиц товара
	Параметры.Вставить("Цена");         // Цена за единицу товара в рублях
	Параметры.Вставить("Сертификаты", Новый Массив()); // Сертификаты
	Возврат Параметры; 
	
КонецФункции

// Пустая структура параметров сертификата
// 
// Возвращаемое значение:
//   Структура:
//   * Идентификатор - Строка - Идентификатор сертификата
//   * Количество - Число - Количество
//   * Цена - Число - Цена 
//   * МаксимальнаяЦена - Число - Максимальная цена
//
Функция ПараметрыСертификата() Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("Идентификатор");    // Идентификатор
	Параметры.Вставить("Количество");       // Количество
	Параметры.Вставить("Цена");             // Цена 
	Параметры.Вставить("МаксимальнаяЦена"); // Максимальная цена
	Возврат Параметры; 
	
КонецФункции  

// Результат выполнения операции взаимодействия с сервером НСПК
//
// Параметры:
//   Результат - Булево.
//   ОписаниеОшибки - Строка.
//
// Возвращаемое значение:
//   Структура:
//   * Результат - Булево.
//   * КодРезультата - Число.
//   * ОписаниеОшибки - Строка.
//   * ТоварныеПозиции - Массив.
//   * ИдентификаторКорзины - Число.
//   * СуммаСертификатами - Число.
//
Функция ПараметрыВыполненияОперации(Результат = Ложь, ОписаниеОшибки = Неопределено) Экспорт
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("Результат"     , Результат);
	РезультатВыполнения.Вставить("КодРезультата" , 999);
	РезультатВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	РезультатВыполнения.Вставить("ТоварныеПозиции", Новый Массив());
	РезультатВыполнения.Вставить("ИдентификаторКорзины");
	РезультатВыполнения.Вставить("СуммаСертификатами", 0);
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти
