///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьJSONТоварныеПозиции(ТоварныеПозиции) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ЗаписьJSON.УстановитьСтроку();  
	Позиции = Новый Массив();
	Для Каждого Позиция Из ТоварныеПозиции Цикл
		Товар = Новый Структура();
		Товар.Вставить("articleNumber", Позиция.НомерПозиции);
		Если Позиция.Свойство("Артикул") Тогда
			Товар.Вставить("articleCode", Позиция.Артикул);
		КонецЕсли;
		Если Позиция.Свойство("НомерПозицииВозврата") Тогда
			Товар.Вставить("originalArticleNumber", Позиция.НомерПозицииВозврата);
		КонецЕсли;
		Товар.Вставить("truCode", Позиция.КодТовараТРУ);
		Товар.Вставить("count"  , Позиция.Количество);
		Товар.Вставить("price"  , Позиция.Цена * 100); // Цена за единицу товара в копейках
		Позиции.Добавить(Товар);
	КонецЦикла;
	ЗаписатьJSON(ЗаписьJSON, Позиции);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьJSONРезультатОперации(СтрокаJSON, СписокОшибок = Неопределено, ОснованиеФискальнойОперации = Неопределено) Экспорт 
	
	ОписаниеОшибки = ?(ПустаяСтрока(СписокОшибок), "", СписокОшибок); 
	РезультатВыполнения = ЭлектронныеСертификатыНСПККлиентСервер.ПараметрыВыполненияОперации(Ложь, ОписаниеОшибки);
	
	Если Не ПустаяСтрока(СтрокаJSON) Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
		РезультатОперации = ПрочитатьJSON(ЧтениеJSON);
		Если РезультатОперации.Свойство("result") Тогда
			РезультатВыполнения.КодРезультата = Число(РезультатОперации.result.code);
			РезультатВыполнения.Результат = РезультатВыполнения.КодРезультата = 0;
			РезультатВыполнения.ОписаниеОшибки = РезультатОперации.result.description;   
			Если НЕ ПустаяСтрока(ОписаниеОшибки) Тогда
				РезультатВыполнения.ОписаниеОшибки = РезультатВыполнения.ОписаниеОшибки = Символы.ПС + ОписаниеОшибки;            
			КонецЕсли;               
		КонецЕсли;               
		
		Если РезультатВыполнения.Результат И РезультатОперации.Свойство("purchaseBasketId") Тогда
			РезультатВыполнения.ИдентификаторКорзины = РезультатОперации.purchaseBasketId; 
		КонецЕсли; 
		
		Если РезультатВыполнения.Результат И РезультатОперации.Свойство("basket") Тогда
			
			Если РезультатОперации.basket.Свойство("purchaseBasketId") Тогда
				РезультатВыполнения.ИдентификаторКорзины = РезультатОперации.basket.purchaseBasketId;
			КонецЕсли; 
			Если РезультатОперации.basket.Свойство("returnBasketId") Тогда
				РезультатВыполнения.ИдентификаторКорзины = РезультатОперации.basket.returnBasketId; 
			КонецЕсли; 
			Если РезультатОперации.basket.Свойство("totalCertAmount") И Число(РезультатОперации.basket.totalCertAmount) > 0 Тогда
				РезультатВыполнения.СуммаСертификатами = Число(РезультатОперации.basket.totalCertAmount) / 100; 
			КонецЕсли;       
			
			Если РезультатОперации.basket.Свойство("article") Тогда
				Для Каждого Позиция Из РезультатОперации.basket.article Цикл
					ТоварнаяПозиция =  ЭлектронныеСертификатыНСПККлиентСервер.ПараметрыТоварнойПозиции();
					Если Позиция.Свойство("articleCode") Тогда
						ТоварнаяПозиция.Артикул = Позиция.articleCode;
					КонецЕсли;                     
					Если Позиция.Свойство("articleNumber") Тогда
						ТоварнаяПозиция.НомерПозиции = Позиция.articleNumber;
					КонецЕсли; 
					Если Позиция.Свойство("price") Тогда
						ТоварнаяПозиция.Цена = Число(Позиция.price) / 100;
					КонецЕсли; 
					Если Позиция.Свойство("truCode") Тогда
						ТоварнаяПозиция.КодТовараТРУ = Позиция.truCode;
					КонецЕсли;     
					
					Если Позиция.Свойство("certificate") Тогда
						Для Каждого Сертификат Из Позиция.certificate Цикл
							СертификатСтрока =  ЭлектронныеСертификатыНСПККлиентСервер.ПараметрыСертификата();
							Если Сертификат.Свойство("certificateId") Тогда
								СертификатСтрока.Идентификатор = Сертификат.certificateId;
							КонецЕсли;                     
							Если Сертификат.Свойство("certCount") Тогда
								СертификатСтрока.Количество = Сертификат.certCount;
							КонецЕсли;                     
							Если Сертификат.Свойство("certPrice") Тогда
								СертификатСтрока.Цена = Число(Сертификат.certPrice) / 100;
							КонецЕсли;                     
							Если Сертификат.Свойство("certMaxPrice") Тогда
								СертификатСтрока.МаксимальнаяЦена = Число(Сертификат.certMaxPrice) / 100;
							КонецЕсли;                     
							ТоварнаяПозиция.Сертификаты.Добавить(СертификатСтрока);
						КонецЦикла;
					КонецЕсли;     
					
					РезультатВыполнения.ТоварныеПозиции.Добавить(ТоварнаяПозиция)
				КонецЦикла;
			КонецЕсли;  
				
		КонецЕсли;
		ЧтениеJSON.Закрыть();
	Иначе                      
		РезультатВыполнения.ОписаниеОшибки = ?(ПустаяСтрока(ОписаниеОшибки), НСтр("ru = 'Ответ не получен'"), ОписаниеОшибки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОснованиеФискальнойОперации) Тогда
		ЭлектронныеСертификатыНСПК.ОбработатьРезультатОтправкиПодтверждения(ОснованиеФискальнойОперации, РезультатВыполнения);
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти
