
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
// Параметры:
//  ДрайвераОборудования - ТаблицаЗначений - см. МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования()
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID;
	Драйвер.ИмяДрайвера  = "ДрайверERFIDСчитывательRFID";
	Драйвер.Наименование = "ERFID:Считыватель RFID";
	Драйвер.ИдентификаторОбъекта = "RFIDReader"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID;
	Драйвер.ИмяДрайвера  = "ДрайверКлеверенсСчитывателиRFID";
	Драйвер.Наименование = "Клеверенс:Считыватели RFID";
	Драйвер.ИдентификаторОбъекта = "Cleverence.TO_RFID"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодСчитывательRFIDCipherLab";
	Драйвер.Наименование = "Сканкод:Считыватели RFID CipherLab";
	Драйвер.ИдентификаторОбъекта = "CipherLab186x"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID;
	Драйвер.ИмяДрайвера  = "ДрайверISBCСчитывательRFID";
	Драйвер.Наименование = "ISBC:Считыватель RFID";
	Драйвер.ИдентификаторОбъекта = "RFIDDevice"; 
	
КонецПроцедуры

#КонецОбласти
