#Область ПрограммныйИнтерфейс

#Область Локализация

// Выполняет переопределяемую команду
//
// Параметры:
//  Форма	- ФормаКлиентскогоПриложения - форма, в которой расположена команда
//  Команда	- КомандаФормы - команда формы
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		СобытияФормИСКлиентПереопределяемый.ВыполнитьПереопределяемуюКомандуИС(Форма, Команда, ДополнительныеПараметры);
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиент");
			Модуль.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормВЕТИСКлиент");
			Модуль.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ГИСМ")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормГИСМКлиент");
			Модуль.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиент");
			Модуль.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиент");
			Модуль.ОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормВЕТИСКлиент");
			Модуль.ОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ГИСМ")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормГИСМКлиент");
			Модуль.ОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиент");
			Модуль.ОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		СобытияФормИСКлиентПереопределяемый.ОбработкаОповещенияИС(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиент");
			Модуль.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормВЕТИСКлиент");
			Модуль.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ГИСМ")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормГИСМКлиент");
			Модуль.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиент");
			Модуль.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиент");
			Модуль.ПослеЗаписи(Форма, ПараметрыЗаписи);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормВЕТИСКлиент");
			Модуль.ПослеЗаписи(Форма, ПараметрыЗаписи);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ГИСМ")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормГИСМКлиент");
			Модуль.ПослеЗаписи(Форма, ПараметрыЗаписи);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиент");
			Модуль.ПослеЗаписи(Форма, ПараметрыЗаписи);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область СобытияЭлементовФорм

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//   Ограничения: не предполагает контекстный серверный вызов.
//
// Параметры:
//   Форма     - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Произвольный - элемент-источник события "При изменении"
//   ДополнительныеПараметры - Структура    - значения дополнительных параметров влияющих на обработку.
//
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		СобытияФормИСКлиентПереопределяемый.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиент");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормВЕТИСКлиент");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ГИСМ")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормГИСМКлиент");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиент");
			Модуль.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
Процедура ПриВыбореЭлемента(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиент");
			Модуль.ПриВыбореЭлемента(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормВЕТИСКлиент");
			Модуль.ПриВыбореЭлемента(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ГИСМ")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормГИСМКлиент");
			Модуль.ПриВыбореЭлемента(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиент");
			Модуль.ПриВыбореЭлемента(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
Процедура ПриАктивизацииЯчейки(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиент");
			Модуль.ПриАктивизацииЯчейки(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормВЕТИСКлиент");
			Модуль.ПриАктивизацииЯчейки(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ГИСМ")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормГИСМКлиент");
			Модуль.ПриАктивизацииЯчейки(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиент");
			Модуль.ПриАктивизацииЯчейки(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
Процедура ПриАктивизацииСтроки(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиент");
			Модуль.ПриАктивизацииСтроки(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
Процедура ПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиент");
			Модуль.ПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ВЕТИС")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормВЕТИСКлиент");
			Модуль.ПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ГИСМ")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормГИСМКлиент");
			Модуль.ПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование, ДополнительныеПараметры);
		КонецЕсли;
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиент");
			Модуль.ПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбщиеДействияТребующиеЗаписиОбъекта

Процедура ВыполнитьДействиеСЗаписьюОбъекта(Форма, Объект, Действие) Экспорт
	
	ТребуетсяЗапись = Ложь;
	ТекстВопроса = "";
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТребуетсяЗапись = Истина;
		ТекстВопроса = НСтр("ru = 'Документ не записан. Записать?'");
	ИначеЕсли Форма.Модифицированность Тогда
		ТребуетсяЗапись = Истина;
		ТекстВопроса = НСтр("ru = '%1 был изменен. Записать?'");
	КонецЕсли;
	
	Если ТребуетсяЗапись Тогда
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ВыполнитьЗаписьОбъекта",
			ЭтотОбъект,
			Новый Структура("Форма, Действие", Форма, Действие));
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(Действие);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗаписьОбъекта(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Возврат;
	КонецЕсли;
	
	ОбъектЗаписан = Ложь;
	Форма = ДополнительныеПараметры.Форма;
	
	Если Форма.ПроверитьЗаполнение() Тогда
		ОбъектЗаписан = Форма.Записать();
	КонецЕсли;
	
	Если ОбъектЗаписан Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Действие);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ВнешнееСобытиеПреобразоватьДанныеСоСканераВСтруктуру(Форма, Источник, Событие, Данные) Экспорт
	
	Если Не Форма.ВводДоступен() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеСобытия = Новый Структура;
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие" , Событие);
	ОписаниеСобытия.Вставить("Данные"  , Данные);
	
	Результат = МенеджерОборудованияКлиент.ПолучитьСобытиеОтУстройства(ОписаниеСобытия);
	
	ДанныеСоСканера = Неопределено;
	
	Если Результат <> Неопределено
		И Результат.Источник = "ПодключаемоеОборудование"
		И Результат.ИмяСобытия = "ScanData"
		И Найти(Форма.ПоддерживаемыеТипыПодключаемогоОборудования, "СканерШтрихкода") > 0 Тогда
		
		ОценкаПроизводительностиКлиент.ЗамерВремени("ОбщийМодуль.СобытияФормИСКлиент.ВнешнееСобытиеОбработатьВводШтрихкода");
		ДанныеСоСканера = ПреобразоватьДанныеСоСканераВСтруктуру(Результат.Параметр);
		
		Возврат ДанныеСоСканера;
		
	ИначеЕсли Результат <> Неопределено
		И Результат.Источник = "ПодключаемоеОборудование"
		И Результат.ИмяСобытия = "RFID"
		И Найти(Форма.ПоддерживаемыеТипыПодключаемогоОборудования, "СчитывательRFID") > 0
		И Не Форма.ИдетЗаписьRFID
		И СобытияФормИСКлиент.ДляОбработкиRFIDНуженСерверныйВызов(Результат.Параметр, Форма) Тогда
		
		Если глПодключаемоеОборудованиеСобытиеОбработаноДанные = Неопределено Тогда
			глПодключаемоеОборудованиеСобытиеОбработаноДанные = Новый Соответствие();
		КонецЕсли;
		глПодключаемоеОборудованиеСобытиеОбработаноДанные.Вставить(Данные, ОбщегоНазначенияКлиент.ДатаУниверсальная());
		
		СырыеДанные = Результат.Параметр;
		Если СырыеДанные.Количество() = 1 Тогда
			ДанныеRFID = ШтрихкодированиеИСКлиентСервер.ИнициализироватьДанныеRFID(СырыеДанные[0]);
		Иначе
			РезультатОбработкиСырыхДанных = ШтрихкодированиеИСВызовСервера.ДанныеRFID(СырыеДанные);
			ДанныеRFID = РезультатОбработкиСырыхДанных.ДанныеRFID;
			Если ЗначениеЗаполнено(РезультатОбработкиСырыхДанных.ТекстОшибки) Тогда
				ИнтеграцияИСКлиент.СообщитьПользователюВФорму(
					Форма.УникальныйИдентификатор,
					РезультатОбработкиСырыхДанных.ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		Возврат ДанныеRFID;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//Типовой сценарий обработки оповещения прикладных объектов об изменениях в библиотечных.
//   Вызывается для обновления гиперссылок в прикладных документах.
// 
// Параметры:
//   МестоВызова - Структура - сведения о месте в котором требуется обработка:
//    * Форма  - ФормаКлиентскогоПриложения     - источник вызова
//    * Объект - ДанныеФормыСтруктура - основной реквизит формы
//   Событие     - Структура - сведения о событии:
//    * Имя        - Строка       - имя события формы
//    * Параметр   - Произвольный - параметр события формы
//    * Источник   - Произвольный - источник события формы
//    * Обработано - Булево       - признак что событие уже обработано
//   Подсистема  - Структура - сведения о подсистеме ГосИС - источнике события:
//    * Имя       - Строка           - имя подсистемы
//    * Документы - Массив Из Строка - имена документов, для которых требуется обработка оповещения
//
Процедура ОбработкаОповещенияВФормеДокументаОснования(МестоВызова, Событие, Подсистема) Экспорт
	
	ОписаниеСобытия = ИнтеграцияИСКлиентСервер.ПреобразоватьИмяСобытияОповещенияВоВнутреннийФормат(Событие.Имя);
	
	// Проверим корректность имени события оповещения.
	Если ИнтеграцияИСКлиентСервер.ЭтоСобытиеОповещенияИзмененоСостояние(ОписаниеСобытия)
	 ИЛИ ИнтеграцияИСКлиентСервер.ЭтоСобытиеОповещенияВыполненОбмен(ОписаниеСобытия) Тогда
		
		Событие.Обработано = Истина;
		
	ИначеЕсли ИнтеграцияИСКлиентСервер.ЭтоСобытиеОповещенияИзмененОбъект(ОписаниеСобытия) Тогда
		
		ИмяИзмененногоОбъекта = ИнтеграцияИСКлиентСервер.ИмяИзмененногоОбъектаИзВнутреннегоФорматаСобытияОповещения(ОписаниеСобытия);
		ЧастиИмениОбъекта     = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяИзмененногоОбъекта, ".");
		
		Если ЧастиИмениОбъекта.Количество() = 2 
			И ЧастиИмениОбъекта[0] = "Документ" Тогда
			ОбрабатываютсяДокументы = Подсистема.МодульВызовСервера.ИменаДокументовДляДокументаОснования(МестоВызова.Объект.Ссылка);
			Если ОбрабатываютсяДокументы.Найти(ЧастиИмениОбъекта[1]) <> Неопределено Тогда
				Событие.Обработано = Истина; // будет обработано далее по коду
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Событие.Обработано Тогда
		
		// Проверим, что оповещение относится к объекту указанной формы.
		ОбязательныеПараметрыОповещения = Новый Структура("Основание");
		Если Событие.Параметр <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ОбязательныеПараметрыОповещения, Событие.Параметр);
		КонецЕсли;
		
		Если Событие.Параметр = Неопределено ИЛИ ОбязательныеПараметрыОповещения.Основание = МестоВызова.Объект.Ссылка Тогда
			
			ИнтеграцияИСКлиент.ОбновитьПолеИнтеграцииВФормеДокументаОснования(
				МестоВызова.Форма,
				Подсистема);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при сканировании штрихкода в форме объекта.
//
// Параметры:
//  ЗавершениеОбработки - Строка - имя процедуры формы, вызываемой при завершении обработки,
//  Форма - ФормаКлиентскогоПриложения - форма, в которой отсканирован штрихкод,
//  Источник - Строка - источник внешнего события,
//  Событие - Строка - наименование события,
//  Данные - Строка - данные для события,
//  ПараметрыСканирования - Структура - параметры сканирования акцизных марок.
//
Процедура ВнешнееСобытиеПолученыШтрихкоды(ЗавершениеОбработки, Форма, Источник, Событие, Данные, ПараметрыСканирования = Неопределено) Экспорт
	
	Если Не Форма.ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСобытия = Новый Структура;
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие" , Событие);
	ОписаниеСобытия.Вставить("Данные"  , Данные);
	
	Результат = МенеджерОборудованияКлиент.ПолучитьСобытиеОтУстройства(ОписаниеСобытия);
	
	Если Результат <> Неопределено
		И Результат.Источник = "ПодключаемоеОборудование"
		И Результат.ИмяСобытия = "ScanData"
		И Найти(Форма.ПоддерживаемыеТипыПодключаемогоОборудования, "СканерШтрихкода") > 0 Тогда
		
		ОценкаПроизводительностиКлиент.ЗамерВремени("ОбщийМодуль.СобытияФормИСКлиент.ВнешнееСобытиеПолученыШтрихкоды");
		
		ДанныеШтрихкода = ПреобразоватьДанныеСоСканераВСтруктуру(Результат.Параметр);
		
		// Печатает новый код маркировки. Подменяет отсканированный код номенклатуры кодом маркировки.
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ГосИС.ИСМП")
				И ПараметрыСканирования <> Неопределено Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеИСМПКлиент");
			Модуль.ОбработатьСобытиеПотоковойПечати(Форма, ДанныеШтрихкода, ПараметрыСканирования)
		КонецЕсли;
		
		// Обрабатывает сканирование существующего кода маркировки в формах проверки и подбора.
		Если ПараметрыСканирования <> Неопределено
			И ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева
			И ПараметрыСканирования.ДопустимыеВидыПродукции.Количество() = 1 Тогда
			
			ВидПродукции = ПараметрыСканирования.ДопустимыеВидыПродукции[0];
			
			Если ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная") Тогда
				
				НормализованныйШтрихкод = ДанныеШтрихкода.Штрихкод;
				
			Иначе
				
				ПримечаниеКРазборуШтрихкода      = Неопределено;
				ПользовательскиеПараметрыРазбора = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
				ПользовательскиеПараметрыРазбора.ВалидироватьШтрихкодЛогистическойУпаковкиGS1128СОшибками = (ТипЗнч(ПараметрыСканирования.СсылкаНаОбъект) <> Тип("ДокументСсылка.МаркировкаТоваровИСМП"));
				ДанныеРазбора = РазборКодаМаркировкиИССлужебныйКлиент.РазобратьКодМаркировки(
					ДанныеШтрихкода.Штрихкод, ВидПродукции, ПримечаниеКРазборуШтрихкода,, ПользовательскиеПараметрыРазбора);
				
				Если ДанныеРазбора = Неопределено Тогда
					
					НормализованныйШтрихкод = ДанныеШтрихкода.Штрихкод;
					
				ИначеЕсли ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(ВидПродукции) Тогда
					
					ДанныеРазбораИРезультат = Новый Структура;
					ДанныеРазбораИРезультат.Вставить("ДанныеРазбора",               ДанныеРазбора);
					ДанныеРазбораИРезультат.Вставить("ПримечаниеКРазборуШтрихкода", ПримечаниеКРазборуШтрихкода);
					
					КешДанныхРазбора = Новый Соответствие;
					КешДанныхРазбора.Вставить(ДанныеШтрихкода.Штрихкод, ДанныеРазбораИРезультат);
					
					НормализованныйШтрихкод = РазборКодаМаркировкиИССлужебныйКлиент.НормализованныйШтрихкод(
						ДанныеШтрихкода.Штрихкод, ВидПродукции, КешДанныхРазбора);
					
				Иначе
					
					НормализованныйШтрихкод = ДанныеРазбора.НормализованныйКодМаркировки;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Форма.СоответствиеШтрихкодовСтрокДерева.Получить(НормализованныйШтрихкод) <> Неопределено Тогда
				Если ИнтеграцияИСКлиентСервер.ЭтоПродукцияИСМП(ВидПродукции) Тогда
					СтрокаДерева = НайтиПоИдентификатору(Форма.ДеревоМаркированнойПродукции,
						Форма.СоответствиеШтрихкодовСтрокДерева.Получить(НормализованныйШтрихкод));
					Если СтрокаДерева <> Неопределено Тогда
						ЕстьВложенныеСтроки = Ложь;
						Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(СтрокаДерева.ТипУпаковки) Тогда
							ЕстьВложенныеСтроки = СтрокаДерева.ПолучитьЭлементы().Количество() > 0;
						КонецЕсли;
						Если Форма.ДопустимаПроизвольнаяЕдиницаУчета
							И Форма.ПараметрыПроверкиКодовМаркировки.ЗапрашиватьКоличествоМерногоТовара
							И ЗначениеЗаполнено(СтрокаДерева.ВидУпаковки)
							И СтрокаДерева.ПроизвольнаяЕдиницаУчета
							И СтрокаДерева.Количество = 0
							И Не ЕстьВложенныеСтроки Тогда
							ШтрихкодированиеИСКлиент.ОбработатьДанныеШтрихкода(
								ЗавершениеОбработки, Форма, ДанныеШтрихкода, ПараметрыСканирования, ДанныеРазбора);
							Возврат;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				ДанныеШтрихкода.Штрихкод = НормализованныйШтрихкод;
				Если ИнтеграцияИСКлиентСервер.ЭтоПродукцияИСМП(ВидПродукции, Истина) Тогда
					МодульПроверкаИПодборПродукцииИСМПКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроверкаИПодборПродукцииИСМПКлиентСервер");
					МодульПроверкаИПодборПродукцииИСМПКлиентСервер.ДополнитьДанныеШтрихкодаПолнымКодомМаркировки(
						ДанныеШтрихкода,
						ДанныеРазбора,
						ВидПродукции,
						ПараметрыСканирования);
				КонецЕсли;
				ОповещениеПриЗавершении = Новый ОписаниеОповещения(ЗавершениеОбработки, Форма);
				ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ДанныеШтрихкода);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		ШтрихкодированиеИСКлиент.ОбработатьДанныеШтрихкода(
			ЗавершениеОбработки, Форма, ДанныеШтрихкода, ПараметрыСканирования, ДанныеРазбора);
		
	ИначеЕсли Результат <> Неопределено
		И Результат.Источник = "ПодключаемоеОборудование"
		И Результат.ИмяСобытия = "RFID"
		И Найти(Форма.ПоддерживаемыеТипыПодключаемогоОборудования, "СчитывательRFID") > 0
		И Не Форма.ИдетЗаписьRFID
		И СобытияФормИСКлиент.ДляОбработкиRFIDНуженСерверныйВызов(Результат.Параметр, Форма) Тогда
		
		Если глПодключаемоеОборудованиеСобытиеОбработаноДанные = Неопределено Тогда
			глПодключаемоеОборудованиеСобытиеОбработаноДанные = Новый Соответствие();
		КонецЕсли;
		глПодключаемоеОборудованиеСобытиеОбработаноДанные.Вставить(Данные, ОбщегоНазначенияКлиент.ДатаУниверсальная());
		
		СырыеДанные = Результат.Параметр;
		Если СырыеДанные.Количество() = 1 Тогда
			ДанныеRFID = ШтрихкодированиеИСКлиентСервер.ИнициализироватьДанныеRFID(СырыеДанные[0]);
		Иначе
			РезультатОбработкиСырыхДанных = ШтрихкодированиеИСВызовСервера.ДанныеRFID(СырыеДанные);
			ДанныеRFID = РезультатОбработкиСырыхДанных.ДанныеRFID;
			Если ЗначениеЗаполнено(РезультатОбработкиСырыхДанных.ТекстОшибки) Тогда
				ИнтеграцияИСКлиент.СообщитьПользователюВФорму(
					Форма.УникальныйИдентификатор,
					РезультатОбработкиСырыхДанных.ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеRFID <> Неопределено Тогда
			ШтрихкодированиеИСКлиент.ОбработатьДанныеRFID(
				ЗавершениеОбработки, Форма, ДанныеRFID, ПараметрыСканирования, Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Инициализирует параметры для обработки штрихкода через внешнее событие.
// 
// Возвращаемое значение:
//  Структура - Описание:
// * ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Необязательный параметр. Нужно заполнять в случае необходимости
//       отбора по виду продукции и при отсутствии параметров сканирования.
// * ПараметрыСканирования - См. ШтрихкодированиеИСКлиент.ПараметрыСканирования
// * Оповещение - ОписаниеОповещения - после обработки штрихкода по данному оповещению будет передан результат обработки
//       штрихкода. Параметр необязателен.
// * КэшированныеЗначения - Структура - закэшированные значения.
// * Данные - Строка - данные для события.
// * Событие - Строка - наименование события.
// * Источник - Строка - источник внешнего события.
Функция ПараметрыОбработкиВводаШтрихкода() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Источник");
	Параметры.Вставить("Событие");
	Параметры.Вставить("Данные");
	Параметры.Вставить("КэшированныеЗначения");
	Параметры.Вставить("Оповещение");
	Параметры.Вставить("ПараметрыСканирования");
	Параметры.Вставить("ВидПродукции");
	
	Возврат Параметры;
	
КонецФункции

// В процедуре нужно реализовать алгоритм преобразования данных из подсистемы подключаемого оборудования.
//
// Параметры:
//  Параметр - Массив - входящие данные.
//
// Возвращаемое значение:
//  Массив - Массив структур со свойствами:
//   * Штрихкод   - Строка - штрихкод,
//   * Количество - Число  - количество.
Функция ПреобразоватьДанныеСоСканераВМассив(Параметр) Экспорт
	
	Результат = Новый Массив;
	СобытияФормИСКлиентПереопределяемый.ПреобразоватьДанныеСоСканераВМассив(Результат, Параметр);
	Возврат Результат;
	
КонецФункции

// В процедуре нужно реализовать алгоритм преобразования данных из подсистемы подключаемого оборудования.
//
// Параметры:
//  Параметр - Массив - входящие данные.
//
// Возвращаемое значение:
//  Структура - структура со свойствами:
//   * Штрихкод   - Строка - Штрихкод,
//   * Количество - Число  - количество.
Функция ПреобразоватьДанныеСоСканераВСтруктуру(Параметр) Экспорт
	
	Результат = Новый Структура("Штрихкод, Количество");
	СобытияФормИСКлиентПереопределяемый.ПреобразоватьДанныеСоСканераВСтруктуру(Результат, Параметр);
	Возврат Результат;
	
КонецФункции

#Область RFID

// Для обработки RFID нужен серверный вызов
//
// Параметры:
//  ДанныеRFID - Массив - данные меток
//  Форма      - ФормаКлиентскогоПриложения - форма, из которой вызывается функция.
// 
// Возвращаемое значение:
// Булево - Истина, если нужен серверный вызов.
//
Функция ДляОбработкиRFIDНуженСерверныйВызов(ДанныеRFID, Форма) Экспорт
	
	ЕстьЗаполненныйTID = Ложь;
	Для Каждого Метка Из ДанныеRFID Цикл
		
		// Если TID не считался, то нельзя считать чтение метки успешным
		Если ЗначениеЗаполнено(Метка.TID) Тогда
			ЕстьЗаполненныйTID = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьЗаполненныйTID Тогда
		
		ПараметрыОперацииСчитывателяRFID = ПараметрыОперацииСчитывателяRFID();
		ПараметрыОперацииСчитывателяRFID.ВыполненноеДействие = "ОбработкаСчитывания";
		ПараметрыОперацииСчитывателяRFID.Форма               = Форма;
		
		ЗакрытьСессиюСчитывателяRFID(Неопределено, ПараметрыОперацииСчитывателяRFID);
		
		Возврат Истина;
		
	Иначе
		
		// Если нет корректно считанных меток, то ничего не делаем - ждем еще события от оборудования.
		// В следующем событии могут уже приехать корректные данные.
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Открыть сессию считывателя RFID
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения - форма, из которой вызывается процедура
//  СледующееДействие - ОписаниеОповещения - описание следующего действия.
//
Процедура ОткрытьСессиюСчитывателяRFID(Форма, СледующееДействие = Неопределено) Экспорт
	
	ОткрытаСессияСчитывателяRFID = Форма.ОткрытаСессияСчитывателяRFID;
	УникальныйИдентификатор      = Форма.УникальныйИдентификатор;
	СчитывательRFID              = Форма.СчитывательRFID;
	
	Если Не ОткрытаСессияСчитывателяRFID Тогда
		
		ПараметрыОперацииСчитывателяRFID = ПараметрыОперацииСчитывателяRFID();
		
		ПараметрыОперацииСчитывателяRFID.ВыполненноеДействие = "ОткрытиеСессии";
		ПараметрыОперацииСчитывателяRFID.СледующееДействие   = СледующееДействие;
		ПараметрыОперацииСчитывателяRFID.Форма               = Форма;
		
		ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения(
			"ЗавершениеОперацииСчитывателяRFID", ЭтотОбъект, ПараметрыОперацииСчитывателяRFID);
		
		МенеджерОборудованияКлиентИС.НачатьОткрытиеСессииСчитывателяRFID(
			ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID);
		
	КонецЕсли;
	
КонецПроцедуры

// Отработать таймаут ожидания считывания RFID-метки
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, из которой вызывается процедура.
//
Процедура ОтработатьТаймаутОжиданияСчитыванияRFID(Форма) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Истекло время ожидания чтения RFID-метки.
		           |Возможные проблемы: метка находится вне зоны считывания,
		           |метка повреждена или чтение заводской метки в настройках оборудования не включено.'"));
	
	ПараметрыОперацииСчитывателяRFID = ПараметрыОперацииСчитывателяRFID();
	ПараметрыОперацииСчитывателяRFID.ВыполненноеДействие = "ТаймаутОжиданияСчитывания";
	ПараметрыОперацииСчитывателяRFID.Форма               = Форма;
	
	ЗакрытьСессиюСчитывателяRFID(Неопределено, ПараметрыОперацииСчитывателяRFID);
	
КонецПроцедуры

// Записать данные в RFID-метку
//
// Параметры:
//  СлужебныеДанные - Неопределено, Структура,- служебный параметр описания оповещения подключение оборудования.
//  ДополнительныеПараметры - Структура - параметры с данными серий для записи.
//
Процедура ЗаписатьДанныеRFID(СлужебныеДанные, ДополнительныеПараметры) Экспорт
	
	Форма               = ДополнительныеПараметры.Форма;
	ДанныеRFIDДляЗаписи = ДополнительныеПараметры.ДанныеRFIDДляЗаписи;
	
	УникальныйИдентификатор      = Форма.УникальныйИдентификатор;
	СчитывательRFID              = Форма.СчитывательRFID;
	ОткрытаСессияСчитывателяRFID = Форма.ОткрытаСессияСчитывателяRFID;
	GTIN                         = Форма.GTIN;
	
	ПараметрыОперацииСчитывателяRFID = ПараметрыОперацииСчитывателяRFID();
	ПараметрыОперацииСчитывателяRFID.Форма = Форма;
	
	Если ТипЗнч(СлужебныеДанные) = Тип("Структура")
		И СлужебныеДанные.Свойство("Результат")
		И СлужебныеДанные.Результат = Ложь Тогда
		Возврат;
	ИначеЕсли Не ОткрытаСессияСчитывателяRFID Тогда
		
		ТекущееДействие = Новый ОписаниеОповещения(
			"ЗаписатьДанныеRFID", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьСессиюСчитывателяRFID(Форма, ТекущееДействие);
		Возврат;
		
	КонецЕсли;
	
	РезультатРасчетаНомера = МенеджерОборудованияКлиентСервер.ПолучитьСерийныйНомерПоTID(ДанныеRFIDДляЗаписи.TID);
	
	СерийныйНомер = Неопределено;
	Если РезультатРасчетаНомера.Результат Тогда
		СерийныйНомер = Формат(РезультатРасчетаНомера.СерийныйНомер, "ЧГ=0");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'Номер серии должен быть сгенерирован по TID RFID-метки.
				           |При генерации произошла ошибка: %1. Обратитесь к администратору.'"),
				РезультатРасчетаНомера.ОписаниеОшибки));
	КонецЕсли;
	
	ПараметрыЗаписи = МенеджерОборудованияКлиентИС.ПараметрыЗаписиМеткиRFID();
	ПараметрыЗаписи.TID        = ДанныеRFIDДляЗаписи.TID;
	ПараметрыЗаписи.EPC        = ДанныеRFIDДляЗаписи.EPC;
	ПараметрыЗаписи.БанкПамяти = "EPC";
	ПараметрыЗаписи.Данные     = МенеджерОборудованияКлиентСервер.СформироватьДанныеSGTIN96(GTIN, СерийныйНомер, 1);
	
	ДополнительныеПараметры.ДанныеRFIDДляЗаписи.ЗаписанныйEPC = ПараметрыЗаписи.Данные;
	
	ПараметрыОперацииСчитывателяRFID.ВыполненноеДействие = "ЗаписьRFID";
	ПараметрыОперацииСчитывателяRFID.СледующееДействие = Новый ОписаниеОповещения(
		"ПослеЗаписиДанныхRFID", ЭтотОбъект, ДополнительныеПараметры);
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения(
		"ЗавершениеОперацииСчитывателяRFID", ЭтотОбъект, ПараметрыОперацииСчитывателяRFID);
	
	МенеджерОборудованияКлиентИС.НачатьЗаписьДанныхВМеткуRFID(
		ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID, ПараметрыЗаписи);
	
КонецПроцедуры

// Записать данные RFID завершение
//
// Параметры:
//  Результат - Структура - со свойствами:
//   * Результат - Булево - признак успешного выполнения предыдущей операции
//  Параметры - Структура - со свойствами:
//   * ДанныеШтрихкода - Структура - с данными серии в свойствах.
//
Процедура ПослеЗаписиДанныхRFID(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрыОперацииСчитывателяRFID = ПараметрыОперацииСчитывателяRFID();
	ПараметрыОперацииСчитывателяRFID.Форма = ДополнительныеПараметры.Форма;
	ЗакрытьСессиюСчитывателяRFID(Неопределено, ПараметрыОперацииСчитывателяRFID);
	
	ВыполнитьОбработкуОповещения(
		ДополнительныеПараметры.ОповещениеПриЗавершении,
		Результат);
	
КонецПроцедуры

// Отключить оборудование
//
// Параметры:
//  Результат - Неопределено - не используется (служебный параметр)
//  ДополнительныеПараметры - Структура - содержит свойства:
//   * Форма - ФормаКлиентскогоПриложения - форма, откуда было инициировано отключение оборудования.
//
Процедура ОтключитьОборудование(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Не Форма.ОткрытаСессияСчитывателяRFID Тогда
		
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, Форма);
		
	Иначе
		
		ДействиеОтключитьОборудование = Новый ОписаниеОповещения("ОтключитьОборудование", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыОперацииСчитывателяRFID = ПараметрыОперацииСчитывателяRFID();
		ПараметрыОперацииСчитывателяRFID.Форма             = Форма;
		ПараметрыОперацииСчитывателяRFID.СледующееДействие = ДействиеОтключитьОборудование;
		
		ЗакрытьСессиюСчитывателяRFID(Неопределено, ПараметрыОперацииСчитывателяRFID);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура СообщитьОбОшибке(РезультатВыполнения) Экспорт
	
	ТекстСообщения = СтрШаблон(
		НСтр("ru = 'При выполнении операции произошла ошибка: %1.'"),
		РезультатВыполнения.ОписаниеОшибки);
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиПоИдентификатору(ДанныеФормыДерево, Идентификатор)
	
	// Существует проблема в веб-клиенте: метод НайтиПоИдентификатору, может вернуть ДанныеФормыДерево
	
	Если Идентификатор = -1
		Или Идентификатор = Неопределено
		Или ТипЗнч(Идентификатор) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеФормыЭлементДерева = ДанныеФормыДерево.НайтиПоИдентификатору(Идентификатор);
	
	Если ТипЗнч(ДанныеФормыЭлементДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		Возврат ДанныеФормыЭлементДерева;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#Область СлужебныеПроцедурыИФункцииRFID

Процедура ЗакрытьСессиюСчитывателяRFID(Результат, ПараметрыОперацииСчитывателяRFID)
	
	СчитывательRFID = ПараметрыОперацииСчитывателяRFID.Форма.СчитывательRFID;
	УникальныйИдентификатор = ПараметрыОперацииСчитывателяRFID.Форма.УникальныйИдентификатор;
	
	НовыеПараметрыОперацииСчитывателяRFID = ПараметрыОперацииСчитывателяRFID();
	НовыеПараметрыОперацииСчитывателяRFID.ВыполненноеДействие = "ЗакрытиеСессии";
	
	НовыеПараметрыОперацииСчитывателяRFID.Форма = ПараметрыОперацииСчитывателяRFID.Форма;
	Если ПараметрыОперацииСчитывателяRFID.СледующееДействие <> Неопределено Тогда
		НовыеПараметрыОперацииСчитывателяRFID.ВыполненноеДействие = "ЗакрытиеСессии";
		НовыеПараметрыОперацииСчитывателяRFID.СледующееДействие   = ПараметрыОперацииСчитывателяRFID.СледующееДействие;
	КонецЕсли;
	
	ОписаниеОповещениеПриЗавершении = Новый ОписаниеОповещения("ЗавершениеОперацииСчитывателяRFID", ЭтотОбъект, НовыеПараметрыОперацииСчитывателяRFID);
	МенеджерОборудованияКлиентИС.НачатьЗакрытиеСессииСчитывателяRFID(ОписаниеОповещениеПриЗавершении, УникальныйИдентификатор, СчитывательRFID);
	
КонецПроцедуры

Процедура ЗавершениеОперацииСчитывателяRFID(РезультатВыполнения, ПараметрыОперацииСчитывателяRFID) Экспорт

	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Операция считывателя RFID завершилась с ошибкой: %1'"),
			РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ПараметрыОперацииСчитывателяRFID.Форма.ИдетЗаписьRFID = Ложь;
	ИначеЕсли ПараметрыОперацииСчитывателяRFID.ВыполненноеДействие = "ОткрытиеСессии" Тогда
		ПараметрыОперацииСчитывателяRFID.Форма.ОткрытаСессияСчитывателяRFID = Истина;
	ИначеЕсли ПараметрыОперацииСчитывателяRFID.ВыполненноеДействие = "ЗакрытиеСессии" Тогда
		ПараметрыОперацииСчитывателяRFID.Форма.ОткрытаСессияСчитывателяRFID = Ложь;
		ПараметрыОперацииСчитывателяRFID.Форма.ИдетЗаписьRFID = Ложь;
	КонецЕсли;

	Если ПараметрыОперацииСчитывателяRFID.СледующееДействие <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(
			ПараметрыОперацииСчитывателяRFID.СледующееДействие,
			РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыОперацииСчитывателяRFID()
	
	Результат = Новый Структура;
	Результат.Вставить("ВыполненноеДействие", "");
	Результат.Вставить("СледующееДействие");
	Результат.Вставить("Форма");
	Результат.Вставить("Форма");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти