#Область ПрограммныйИнтерфейс

Функция СоздатьПравилоИнтеграции(ТипОбъектаИС, ТипОбъектаДО, ВидДокумента, Папка) Экспорт
	
	Правило = Справочники.ПравилаИнтеграцииС1СДокументооборотом.СоздатьЭлемент();
	Правило.Заполнить(Неопределено);
	Правило.ТипОбъектаИС = ТипОбъектаИС;
	Правило.ТипОбъектаДО = ТипОбъектаДО;
	Правило.Комментарий = НСтр("ru = 'Создано автоматически'");
	
	ПравилаИнтеграцииМенеджер = Справочники.ПравилаИнтеграцииС1СДокументооборотом;
	
	// вид документа
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"documentType",
		ВидДокумента,
		Ложь,
		Истина);
	
	// папка
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"folder",
		Папка,
		Ложь);
	
	ЗаполнитьОбщиеРеквизиты(ПравилаИнтеграцииМенеджер, ТипОбъектаИС, Правило);
	ЗаполнитьЧастныеРеквизиты(ПравилаИнтеграцииМенеджер, ТипОбъектаИС, Правило);
	
	Правило.Записать();
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Правило.Ссылка);
	Результат.Вставить("ТипОбъектаИС", ТипОбъектаИС);
	Результат.Вставить("ТипОбъектаДО", ТипОбъектаДО);
	Результат.Вставить("ПредставлениеОбъектаИС", ТипОбъектаИС);
	Результат.Вставить("ПредставлениеОбъектаДО", ТипОбъектаДО);
	Результат.Вставить("ИдентификаторВидаДокумента", ВидДокумента.objectId.id);
	Результат.Вставить("ТипВидаДокумента", ВидДокумента.objectId.type);
	
	Возврат Результат;
	
КонецФункции

// Заполняет свойства объекта XDTO из реквизитов объекта конфигурации-потребителя. По умолчанию заполняется
// только наименование и идентификатор. При необходимости обеспечить заполнение других реквизитов объектов
// ДО, создаваемых по ссылкам, следует заполнить соответствующие свойства объекта XDTO. Эти же значения будут
// использованы при поиске соответствий для справочников, имеющих внешние ключи (ИНН, КПП).
//
// Параметры:
//   Прокси - WSПрокси - объект для подключения к web-сервисам Документооборота.
//   ОбъектXDTO - ОбъектXDTO - заполняемый объект.
//   СсылкаНаПотребитель - ЛюбаяСсылка - ссылка на исходный объект конфигурации-потребителя.
//
// Пример:
//	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMCorrespondent")
//			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
//		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель, "ИНН, КПП, ЮрФизЛицо");
//		ОбъектXDTO.inn = Реквизиты.ИНН;
//		ОбъектXDTO.kpp = Реквизиты.КПП;
//		Если Реквизиты.ЮрФизЛицо = Перечисления._ДемоЮрФизЛицо.ЮрЛицо Тогда
//			ОбъектXDTO.legalPrivatePerson = "LglPerson";
//		ИначеЕсли Реквизиты.ЮрФизЛицо = Перечисления._ДемоЮрФизЛицо.ФизЛицо Тогда
//			ОбъектXDTO.legalPrivatePerson = "Individ";
//		ИначеЕсли Реквизиты.ЮрФизЛицо = Перечисления._ДемоЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
//			ОбъектXDTO.legalPrivatePerson = "IndividualEntrepreneur";
//		ИначеЕсли Реквизиты.ЮрФизЛицо = Перечисления._ДемоЮрФизЛицо.ЮрЛицоНеРезидент Тогда
//			ОбъектXDTO.legalPrivatePerson = "LglPersonNonResident";
//		КонецЕсли;
//	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMOrganization")
//			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка._ДемоОрганизации") Тогда
//		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель, "ИНН, КПП");
//		ОбъектXDTO.inn = Реквизиты.ИНН;
//		ОбъектXDTO.kpp = Реквизиты.КПП;
//	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMBankAccount")
//			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка._ДемоБанковскиеСчета") Тогда
//		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель, "Владелец, НомерСчета");
//		ОбъектXDTO.number = Реквизиты.НомерСчета;
//		Если ТипЗнч(Реквизиты.Владелец) = Тип("СправочникСсылка._ДемоКонтрагенты") Тогда
//			ОбъектXDTO.owner = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMCorrespondent");
//		ИначеЕсли ТипЗнч(Реквизиты.Владелец) = Тип("СправочникСсылка._ДемоОрганизации") Тогда
//			ОбъектXDTO.owner = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMOrganization");
//		КонецЕсли;
//		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(Прокси, ОбъектXDTO.owner, Реквизиты.Владелец);
//	Иначе //...
//	КонецЕсли;
//
Процедура ЗаполнитьРеквизитыИзПотребителя(Прокси, ОбъектXDTO, СсылкаНаПотребитель) Экспорт
	
	Если СсылкаНаПотребитель.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	
	Если ТипЗнч(ОбъектXDTO) = Тип("Строка") Или ОбъектXDTO = Неопределено Тогда
		ЗаполнитьПеречислениеXDTOИзПотребителя(ОбъектXDTO, СсылкаНаПотребитель, Настройки);
		
	ИначеЕсли ТипЗнч(ОбъектXDTO) = Тип("ОбъектXDTO") Тогда
		ЗаполнитьСсылочныйОбъектXDTOИзПотребителя(Прокси, ОбъектXDTO, СсылкаНаПотребитель, Настройки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация


//-- Локализация

Процедура ЗаполнитьОбщиеРеквизиты(ПравилаИнтеграцииМенеджер, ТипОбъектаИС, Правило)
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	
	ГрифДоступа = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMAccessLevel");
	ГрифДоступа.externalObject = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
		Прокси,
		"ExternalObject");
	ГрифДоступа.externalObject.id = "";
	ГрифДоступа.externalObject.type = "";
	ГрифДоступа.externalObject.name = "";
	ГрифДоступа.objectId = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьObjectID(Прокси, "", "");
	ГрифДоступа.name = НСтр("ru = 'Общий'");
	
	ВопросДеятельности = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMActivityMatter");
	ВопросДеятельности.externalObject = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
		Прокси,
		"ExternalObject");
	ВопросДеятельности.externalObject.id = "";
	ВопросДеятельности.externalObject.type = "";
	ВопросДеятельности.externalObject.name = "";
	ВопросДеятельности.objectId = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьObjectID(Прокси, "", "");
	ВопросДеятельности.name = НСтр("ru = 'Основная деятельность'");
	
	Документ = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMInternalDocument");
	Документ.objectId = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьObjectID(
		Прокси,
		"",
		"DMInternalDocument");
	Документ.name = НСтр("ru = 'Временный'");
	Документ.accessLevel = ГрифДоступа;
	Документ.activityMatter = ВопросДеятельности;
	
	Запрос = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMCreateRequest");
	Запрос.object = Документ;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВыполнитьЗапрос(Прокси, Запрос);
	
	РазрешеноБезПерепроведения = Неопределено;
	РазрешеноСПерепроведением = Неопределено;
	Запрещено = Неопределено;
	Если Лев(ТипОбъектаИС, 9) = "Документ." Тогда
		РазрешеноБезПерепроведения =
			Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения;
		РазрешеноСПерепроведением =
			Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением;
		Запрещено = Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.Запрещено;
	КонецЕсли;
	
	Правило.НеСоздаватьСвязиПоСсылкам = Истина;
	
	//////////////////////////////////////////////////////
	// Правила выгрузки (Передача в 1С:Документооборот)
	
	// заголовок
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"title",
		"Представление");
	
	// гриф доступа
	
	// Получим гриф доступа
	ГрифДоступа = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.НайтиОбъектВДОПоИмени(
		"DMAccessLevel",
		НСтр("ru = 'Общий'"));
	// Установим правило
	Если ГрифДоступа <> Неопределено Тогда
		ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
			Правило,
			Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
			"accessLevel",
			ГрифДоступа,
			Ложь);
	КонецЕсли;
	
	// вопрос деятельности
	
	// Получим вопрос деятельности
	ВопросДеятельности = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.НайтиОбъектВДОПоИмени(
		"DMActivityMatter",
		НСтр("ru = 'Основная деятельность'"));
	// Установим правило
	Если ВопросДеятельности <> Неопределено Тогда
		ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
			Правило,
			Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
			"activityMatter",
			ВопросДеятельности,
			Ложь);
	КонецЕсли;
	
	//////////////////////////////////////////////////////
	// Правила загрузки (Получение из 1С:Документооборота)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Статус",
		"statusApproval",,,
		РазрешеноСПерепроведением);
	
	//////////////////////////////////////////////////////
	// Парные правила
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Организация",
		"organization",,,
		РазрешеноСПерепроведением);
	Если (ТипОбъектаИС <> "Документ.ЗаявкаНаРасходованиеДенежныхСредств")
			Или (Не ИнтеграцияС1СДокументооборотБазоваяФункциональность.ДоступенФункционалВерсииСервиса("2.1.28.12.CORP")) Тогда
		ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
			Правило,
			"Контрагент",
			"correspondent",,,
			РазрешеноСПерепроведением);
	КонецЕсли;
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Комментарий",
		"comment",,,
		РазрешеноБезПерепроведения);
	
КонецПроцедуры

Процедура ЗаполнитьПеречислениеXDTOИзПотребителя(ОбъектXDTO, СсылкаНаПотребитель, Настройки)
	
	Если Настройки.ИспользоватьИнтеграциюДО3 = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаПотребитель) = Тип("ПеречислениеСсылка.ЮридическоеФизическоеЛицо") Тогда
		
		Если СсылкаНаПотребитель = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
			ОбъектXDTO = "LglPerson";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			ОбъектXDTO = "Individ";
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("ПеречислениеСсылка.ЮрФизЛицо") Тогда
		
		Если СсылкаНаПотребитель = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ОбъектXDTO = "LglPerson";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ОбъектXDTO = "Individ";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
			ОбъектXDTO = "LglPersonNonResident";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ОбъектXDTO = "IndividualEntrepreneur";
			
		КонецЕсли;
		
	//++ Локализация
	ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
		
		Если СсылкаНаПотребитель = Перечисления.СтавкиНДС.БезНДС Тогда
			ОбъектXDTO = "WithoutVAT";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС0 Тогда
			ОбъектXDTO = "VAT0";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС10
				Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС10_110 Тогда
			ОбъектXDTO = "VAT10";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС18
				Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС18_118 Тогда
			ОбъектXDTO = "VAT18";
			
		ИначеЕсли СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС20
				Или СсылкаНаПотребитель = Перечисления.СтавкиНДС.НДС20_120 Тогда
			ОбъектXDTO = "VAT20";
			
		КонецЕсли;
	//-- Локализация
		
	ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		
		Если СсылкаНаПотребитель = Справочники.СтавкиНДС.БезНДС Тогда
			ОбъектXDTO = "WithoutVAT";
			
		Иначе
			Ставка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПотребитель, "Ставка");
			Если Ставка = 0 Тогда
				ОбъектXDTO = "VAT0";
				
			ИначеЕсли Ставка = 10 Тогда
				ОбъектXDTO = "VAT10";
				
			ИначеЕсли Ставка = 18 Тогда
				ОбъектXDTO = "VAT18";
				
			ИначеЕсли Ставка = 20 Тогда
				ОбъектXDTO = "VAT20";
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСсылочныйОбъектXDTOИзПотребителя(Прокси, ОбъектXDTO, СсылкаНаПотребитель, Настройки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMCorrespondent")
			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель,
			"ИНН, КПП, ЮрФизЛицо, КодПоОКПО, НаименованиеПолное");
		
		ОбъектXDTO.inn = Реквизиты.ИНН;
		ОбъектXDTO.kpp = Реквизиты.КПП;
		ОбъектXDTO.okpo = Реквизиты.КодПоОКПО;
		ОбъектXDTO.fullName = Реквизиты.НаименованиеПолное;
		ЗаполнитьЮрФизЛицо(Прокси, Настройки, ОбъектXDTO, Реквизиты.ЮрФизЛицо);
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMContactPerson")
			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	КонтактныеЛицаПартнеров.ДолжностьПоВизитке КАК Должность,
			|	КонтактныеЛицаПартнеров.Комментарий КАК Комментарий,
			|	КонтактныеЛицаПартнеров.Владелец КАК Партнер
			|ПОМЕСТИТЬ ДанныеКонтактногоЛица
			|ИЗ
			|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
			|ГДЕ
			|	КонтактныеЛицаПартнеров.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Контрагент,
			|	ДанныеКонтактногоЛица.Должность КАК Должность,
			|	ДанныеКонтактногоЛица.Комментарий КАК Комментарий
			|ИЗ
			|	ДанныеКонтактногоЛица КАК ДанныеКонтактногоЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО ДанныеКонтактногоЛица.Партнер = Контрагенты.Партнер
			|ГДЕ
			|	НЕ Контрагенты.ПометкаУдаления");
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаПотребитель);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			
			ОбъектXDTO.position = Выборка.Должность;
			ОбъектXDTO.comment = Выборка.Комментарий;
			ОбъектXDTO.correspondent = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMCorrespondent");
			ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
				Прокси,
				ОбъектXDTO.correspondent,
				Выборка.Контрагент);
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMOrganization")
			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Организации") Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель,
			"ИНН, КПП, ЮрФизЛицо, КодПоОКПО, НаименованиеПолное");
		
		ОбъектXDTO.inn = Реквизиты.ИНН;
		ОбъектXDTO.kpp = Реквизиты.КПП;
		ОбъектXDTO.okpo = Реквизиты.КодПоОКПО;
		ОбъектXDTO.fullName = Реквизиты.НаименованиеПолное;
		ЗаполнитьЮрФизЛицо(Прокси, Настройки, ОбъектXDTO, Реквизиты.ЮрФизЛицо);
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMPrivatePerson")
			И ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		СпосокРеквизитов = Новый Массив;
		СпосокРеквизитов.Добавить("ДатаРождения");
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель, СтрСоединить(СпосокРеквизитов, ","));
		
		ОбъектXDTO.birthDay = Реквизиты.ДатаРождения;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMBankAccount")
			И (ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов")
				Или ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций")) Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель, "Владелец, Банк, НомерСчета");
		
		ОбъектXDTO.number = Реквизиты.НомерСчета;
		
		Если ЗначениеЗаполнено(Реквизиты.Владелец) Тогда
			Если ТипЗнч(Реквизиты.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
				ОбъектXDTO.owner = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMCorrespondent");
				
			ИначеЕсли ТипЗнч(Реквизиты.Владелец) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				ОбъектXDTO.owner = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMPrivatePerson");
				
			ИначеЕсли ТипЗнч(Реквизиты.Владелец) = Тип("СправочникСсылка.Организации") Тогда
				ОбъектXDTO.owner = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMOrganization");
				
			КонецЕсли;
			ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
				Прокси,
				ОбъектXDTO.owner,
				Реквизиты.Владелец);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Реквизиты.Банк) Тогда
			ОбъектXDTO.bank = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMBank");
			ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
				Прокси,
				ОбъектXDTO.bank,
				Реквизиты.Банк);
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMSubdivision") Тогда
		
		Руководитель = Неопределено;
		
		//++ Локализация


		//-- Локализация
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
			Руководитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПотребитель, "ТекущийРуководитель");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Руководитель) Тогда
			
			Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
				
				ОбъектXDTO.head = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMUser");
				
			ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
				
				ОбъектXDTO.head = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMEmployee");
				
				ОбъектXDTO.head.subdivision = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMSubdivision");
				ОбъектXDTO.head.subdivision.name = Строка(СсылкаНаПотребитель);
				ОбъектXDTO.head.subdivision.objectID = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьObjectID(
					Прокси,
					"",
					"");
				ОбъектXDTO.head.subdivision.externalObject = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"ExternalObject");
				ОбъектXDTO.head.subdivision.externalObject.type = Строка(ТипЗнч(СсылкаНаПотребитель));
				ОбъектXDTO.head.subdivision.externalObject.name = Строка(СсылкаНаПотребитель);
				Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(СсылкаНаПотребитель)) Тогда
					ОбъектXDTO.head.subdivision.externalObject.ID = Строка(СсылкаНаПотребитель.УникальныйИдентификатор());
				Иначе
					ОбъектXDTO.head.subdivision.externalObject.ID = "";
				КонецЕсли;
				
			КонецЕсли;
			
			ОбъектXDTO.head.name = Строка(Руководитель);
			ОбъектXDTO.head.objectID = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьObjectID(
				Прокси,
				"",
				"");
			ОбъектXDTO.head.externalObject = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"ExternalObject");
			ОбъектXDTO.head.externalObject.type = Строка(ТипЗнч(Руководитель));
				ОбъектXDTO.head.externalObject.name = Строка(Руководитель);
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Руководитель)) Тогда
				ОбъектXDTO.head.externalObject.ID = Строка(Руководитель.УникальныйИдентификатор());
			Иначе
				ОбъектXDTO.head.externalObject.ID = "";
			КонецЕсли;
			
			Если ТипЗнч(Руководитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				ОбъектXDTO.head.privatePerson = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMPrivatePerson");
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO.head.privatePerson,
					Руководитель);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMUser") Тогда
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Пользователи") Тогда
			Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПотребитель, "Подразделение");
			Если ЗначениеЗаполнено(Подразделение) Тогда
				ОбъектXDTO.subdivision = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMSubdivision");
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO.subdivision,
					Подразделение);
			КонецЕсли;
		КонецЕсли;
		
		//++ Локализация


		//-- Локализация
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Пользователи.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.ФизическоеЛицо = &ФизическоеЛицо
				|	И НЕ Пользователи.ПометкаУдаления");
			Запрос.УстановитьПараметр("ФизическоеЛицо", СсылкаНаПотребитель);
			
			ВыборкаПользователи = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаПользователи.Количество() = 1 Тогда
				ВыборкаПользователи.Следующий();
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO,
					ВыборкаПользователи.Ссылка);
				
			Иначе
				ОбъектXDTO.privatePerson = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMPrivatePerson");
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO.privatePerson,
					СсылкаНаПотребитель);
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMEmployee") Тогда
		
		//++ Локализация


		//-- Локализация
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Пользователи") Тогда
			ЗапросПользователь = Новый Запрос(
				"ВЫБРАТЬ
				|	Пользователи.ФизическоеЛицо.Наименование КАК ФизическоеЛицоНаименование,
				|	Пользователи.Подразделение КАК Подразделение
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.Ссылка = &Пользователь");
			ЗапросПользователь.УстановитьПараметр("Пользователь", СсылкаНаПотребитель);
			
			ВыборкаПользователь = ЗапросПользователь.Выполнить().Выбрать();
			Если ВыборкаПользователь.Следующий() Тогда
				
				Если ЗначениеЗаполнено(ВыборкаПользователь.ФизическоеЛицоНаименование) Тогда
					ОбъектXDTO.name = ВыборкаПользователь.ФизическоеЛицоНаименование;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаПользователь.Подразделение) Тогда
					ОбъектXDTO.subdivision = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
						Прокси,
						"DMSubdivision");
					Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ВыборкаПользователь.Подразделение)) Тогда
						ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
							Прокси,
							ОбъектXDTO.subdivision,
							ВыборкаПользователь.Подразделение);
					Иначе
						ОбъектXDTO.subdivision.name = Строка(ВыборкаПользователь.Подразделение);
						ОбъектXDTO.subdivision.objectID = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьObjectID(
							Прокси,
							"",
							"");
						ОбъектXDTO.subdivision.externalObject = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
							Прокси,
							"ExternalObject");
						ОбъектXDTO.subdivision.externalObject.ID = "";
						ОбъектXDTO.subdivision.externalObject.type = Строка(ТипЗнч(ВыборкаПользователь.Подразделение));
						ОбъектXDTO.subdivision.externalObject.name = Строка(ВыборкаПользователь.Подразделение);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			//++ Локализация


			//-- Локализация
			
		КонецЕсли;
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ЗапросПользователь = Новый Запрос(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Пользователи.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.ФизическоеЛицо = &ФизическоеЛицо
				|	И НЕ Пользователи.ПометкаУдаления");
			ЗапросПользователь.УстановитьПараметр("ФизическоеЛицо", СсылкаНаПотребитель);
			
			ВыборкаПользователи = ЗапросПользователь.Выполнить().Выбрать();
			
			Если ВыборкаПользователи.Количество() = 1 Тогда
				ВыборкаПользователи.Следующий();
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO,
					ВыборкаПользователи.Ссылка);
				
			Иначе
				ОбъектXDTO.privatePerson = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMPrivatePerson");
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO.privatePerson,
					СсылкаНаПотребитель);
				
			КонецЕсли;
			
			//++ Локализация


			//-- Локализация
			
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMParty") Тогда
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Контрагенты") Тогда
			ОбъектXDTO.correspondent = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMCorrespondent");
			ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
				Прокси,
				ОбъектXDTO.correspondent,
				СсылкаНаПотребитель);
			
		ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Организации") Тогда
			ОбъектXDTO.organization = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMOrganization");
			ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
				Прокси,
				ОбъектXDTO.organization,
				СсылкаНаПотребитель);
			
		ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Пользователи")
				Или ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
				ОбъектXDTO.user = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMUser");
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO.user,
					СсылкаНаПотребитель);
			ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
				ОбъектXDTO.employee = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMEmployee");
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO.employee,
					СсылкаНаПотребитель);
			КонецЕсли;
			
		//++ Локализация


			//-- Локализация
			
		КонецЕсли;
		
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMPartyRowContact") Тогда
		
		Если ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			ОбъектXDTO.contactPerson = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMContactPerson");
			ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
				Прокси,
				ОбъектXDTO.contactPerson,
				СсылкаНаПотребитель);
			
		ИначеЕсли ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Пользователи")
				Или ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
				ОбъектXDTO.user = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMUser");
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO.user,
					СсылкаНаПотребитель);
			ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
				ОбъектXDTO.employee = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
					Прокси,
					"DMEmployee");
				ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьРеквизитыИзПотребителя(
					Прокси,
					ОбъектXDTO.employee,
					СсылкаНаПотребитель);
			КонецЕсли;
			
		//++ Локализация


			//-- Локализация
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьЧастныеРеквизиты(ПравилаИнтеграцииМенеджер, ТипОбъектаИС, Правило)
	
	Если ТипОбъектаИС = "Справочник.СоглашенияСКлиентами" Тогда
		ДополнитьПравилоИнтеграцииСоглашенияСКлиентами(ПравилаИнтеграцииМенеджер, Правило);
		
	ИначеЕсли ТипОбъектаИС = "Справочник.ДоговорыКонтрагентов" Тогда
		ДополнитьПравилоИнтеграцииДоговорыКонтрагентов(ПравилаИнтеграцииМенеджер, Правило);
		
	ИначеЕсли ТипОбъектаИС = "Документ.КоммерческоеПредложениеКлиенту" Тогда
		ДополнитьПравилоИнтеграцииКоммерческоеПредложениеКлиенту(ПравилаИнтеграцииМенеджер, Правило);
		
	ИначеЕсли ТипОбъектаИС = "Документ.ЗаказКлиента" Тогда
		ДополнитьПравилоИнтеграцииЗаказКлиента(ПравилаИнтеграцииМенеджер, Правило);
		
	ИначеЕсли ТипОбъектаИС = "Документ.ЗаказПоставщику" Тогда
		ДополнитьПравилоИнтеграцииЗаказПоставщику(ПравилаИнтеграцииМенеджер, Правило);
		
	ИначеЕсли ТипОбъектаИС = "Документ.ЗаявкаНаВозвратТоваровОтКлиента" Тогда
		ДополнитьПравилоИнтеграцииЗаявкаНаВозвратТоваровОтКлиента(ПравилаИнтеграцииМенеджер, Правило);
		
	ИначеЕсли ТипОбъектаИС = "Документ.ЗаявкаНаРасходованиеДенежныхСредств" Тогда
		ДополнитьПравилоИнтеграцииЗаявкаНаРасходованиеДенежныхСредств(ПравилаИнтеграцииМенеджер, Правило);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЮрФизЛицо(Прокси, Настройки, ОбъектXDTO, ЮрФизЛицо)
	
	Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
		
		ЮрФизЛицоID = "";
		Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ЮрФизЛицоID = "ФизЛицо"; //@NON-NLS-1
			
		ИначеЕсли ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ЮрФизЛицоID = "ЮрЛицо"; //@NON-NLS-1
			
		ИначеЕсли ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
			ЮрФизЛицоID = "ЮрЛицоНеРезидент"; //@NON-NLS-1
			
		ИначеЕсли ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ЮрФизЛицоID = "ИндивидуальныйПредприниматель"; //@NON-NLS-1
			
		КонецЕсли;
		
		ОбъектXDTO.legalPrivatePerson = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
			Прокси,
			"DMLegalPrivatePerson");
		ОбъектXDTO.legalPrivatePerson.name = Строка(ЮрФизЛицо);
		ОбъектXDTO.legalPrivatePerson.objectID = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьObjectID(
			Прокси,
			ЮрФизЛицоID,
			"DMLegalPrivatePerson");
		
	ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
		
		ЗаполнитьРеквизитыИзПотребителя(Прокси, ОбъектXDTO.legalPrivatePerson, ЮрФизЛицо);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПравилоИнтеграцииСоглашенияСКлиентами(ПравилаИнтеграцииМенеджер, Правило)
	
	//////////////////////////////////////////////////////
	// Правила выгрузки (Передача в 1С:Документооборот)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"author",
		"Менеджер");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"openEnded",
		"Параметры.Результат = Не ЗначениеЗаполнено(Параметры.Источник.ДатаОкончанияДействия);");
	
	// Таблица Стороны
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.ДоступенФункционалВерсииСервиса("2.1.28.12.CORP") Тогда
		ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
			Правило,
			Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
			"partyRows.rows",
			"Параметры.Результат = Новый ТаблицаЗначений;
			|Параметры.Результат.Колонки.Добавить(""Комментарий"");
			|Параметры.Результат.Колонки.Добавить(""КонтактноеЛицо"");
			|Параметры.Результат.Колонки.Добавить(""Наименование"");
			|Параметры.Результат.Колонки.Добавить(""НаименованиеID"");
			|Параметры.Результат.Колонки.Добавить(""НаименованиеТип"");
			|Параметры.Результат.Колонки.Добавить(""Сторона"");
			|Параметры.Результат.Колонки.Добавить(""Установил"");
			|Параметры.Результат.Колонки.Добавить(""ДатаПодписи"");
			|Параметры.Результат.Колонки.Добавить(""Подписан"");
			|Параметры.Результат.Колонки.Добавить(""Подписал"");
			|
			|НоваяСтрока = Параметры.Результат.Добавить();
			|НоваяСтрока.Сторона = Параметры.Источник.Организация;
			|НаименованиеПродавецXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПредопределенноеЗначениеДО(
			|	""DMPartyName"", ""Продавец"");
			|НоваяСтрока.Наименование = НаименованиеПродавецXDTO.name;
			|НоваяСтрока.НаименованиеID = НаименованиеПродавецXDTO.objectID.id;
			|НоваяСтрока.НаименованиеТип = НаименованиеПродавецXDTO.objectID.type;
			|
			|НоваяСтрока = Параметры.Результат.Добавить();
			|НоваяСтрока.Сторона = Параметры.Источник.Контрагент;
			|НаименованиеПокупательXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПредопределенноеЗначениеДО(
			|	""DMPartyName"", ""Покупатель"");
			|НоваяСтрока.Наименование = НаименованиеПокупательXDTO.name;
			|НоваяСтрока.НаименованиеID = НаименованиеПокупательXDTO.objectID.id;
			|НоваяСтрока.НаименованиеТип = НаименованиеПокупательXDTO.objectID.type;
			|Если ЗначениеЗаполнено(Параметры.Источник.КонтактноеЛицо) Тогда
			|	НоваяСтрока.КонтактноеЛицо = Параметры.Источник.КонтактноеЛицо;
			|КонецЕсли;");
	КонецЕсли;
	
	//////////////////////////////////////////////////////
	// Правила загрузки (Получение из 1С:Документооборота)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Наименование",
		"title");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Номер",
		"regNumber");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Дата",
		"regDate");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Согласован",
		"statusApproval");
	
	//////////////////////////////////////////////////////
	// Парные правила
	
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"СуммаДокумента",
		"sum");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Валюта",
		"currency");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Менеджер",
		"responsible");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"КонтактноеЛицо",
		"contactPerson");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"ДатаНачалаДействия",
		"beginDate");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"ДатаОкончанияДействия",
		"endDate");
	
КонецПроцедуры

Процедура ДополнитьПравилоИнтеграцииДоговорыКонтрагентов(ПравилаИнтеграцииМенеджер, Правило)
	
	//////////////////////////////////////////////////////
	// Правила выгрузки (Передача в 1С:Документооборот)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"author",
		"Менеджер");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"VAT",
		"Параметры.Результат = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		|	Параметры.Источник.Сумма,
		|	Параметры.Источник.СтавкаНДС);");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"openEnded",
		"Параметры.Результат = Не ЗначениеЗаполнено(Параметры.Источник.ДатаОкончанияДействия);");
	
	// Таблица Стороны
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.ДоступенФункционалВерсииСервиса("2.1.28.12.CORP") Тогда
		ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
			Правило,
			Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
			"partyRows.rows",
			"Параметры.Результат = Новый ТаблицаЗначений;
			|Параметры.Результат.Колонки.Добавить(""Комментарий"");
			|Параметры.Результат.Колонки.Добавить(""КонтактноеЛицо"");
			|Параметры.Результат.Колонки.Добавить(""Наименование"");
			|Параметры.Результат.Колонки.Добавить(""НаименованиеID"");
			|Параметры.Результат.Колонки.Добавить(""НаименованиеТип"");
			|Параметры.Результат.Колонки.Добавить(""Сторона"");
			|Параметры.Результат.Колонки.Добавить(""Установил"");
			|Параметры.Результат.Колонки.Добавить(""ДатаПодписи"");
			|Параметры.Результат.Колонки.Добавить(""Подписан"");
			|Параметры.Результат.Колонки.Добавить(""Подписал"");
			|
			|НоваяСтрока = Параметры.Результат.Добавить();
			|НоваяСтрока.Сторона = Параметры.Источник.Организация;
			|НаименованиеЗаказчикXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПредопределенноеЗначениеДО(
			|	""DMPartyName"", ""Заказчик"");
			|НоваяСтрока.Наименование = НаименованиеЗаказчикXDTO.name;
			|НоваяСтрока.НаименованиеID = НаименованиеЗаказчикXDTO.objectID.id;
			|НоваяСтрока.НаименованиеТип = НаименованиеЗаказчикXDTO.objectID.type;
			|
			|НоваяСтрока = Параметры.Результат.Добавить();
			|НоваяСтрока.Сторона = Параметры.Источник.Контрагент;
			|НаименованиеИсполнительXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПредопределенноеЗначениеДО(
			|	""DMPartyName"", ""Исполнитель"");
			|НоваяСтрока.Наименование = НаименованиеИсполнительXDTO.name;
			|НоваяСтрока.НаименованиеID = НаименованиеИсполнительXDTO.objectID.id;
			|НоваяСтрока.НаименованиеТип = НаименованиеИсполнительXDTO.objectID.type;
			|Если ЗначениеЗаполнено(Параметры.Источник.КонтактноеЛицо) Тогда
			|	НоваяСтрока.КонтактноеЛицо = Параметры.Источник.КонтактноеЛицо;
			|КонецЕсли;");
	КонецЕсли;
	
	//////////////////////////////////////////////////////
	// Правила загрузки (Получение из 1С:Документооборота)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Наименование",
		"title");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Номер",
		"regNumber");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Дата",
		"regDate");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Согласован",
		"statusApproval");
	
	//////////////////////////////////////////////////////
	// Парные правила
	
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Сумма",
		"sum");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"ВалютаВзаиморасчетов",
		"currency");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Менеджер",
		"responsible");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Подразделение",
		"subdivision");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"КонтактноеЛицо",
		"contactPerson");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"ДатаНачалаДействия",
		"beginDate");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"ДатаОкончанияДействия",
		"endDate");
	
КонецПроцедуры

Процедура ДополнитьПравилоИнтеграцииКоммерческоеПредложениеКлиенту(ПравилаИнтеграцииМенеджер, Правило)
	
	//////////////////////////////////////////////////////
	// Правила выгрузки (Передача в 1С:Документооборот)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"author",
		"Менеджер");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"sum",
		"Если Параметры.Источник.ЦенаВключаетНДС Тогда
		|	Параметры.Результат = Параметры.Источник.СуммаДокумента;
		|Иначе
		|	Параметры.Результат = Параметры.Источник.СуммаДокумента - Параметры.Источник.Товары.Итог(""СуммаНДС"");
		|КонецЕсли;");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"VAT",
		"Параметры.Результат = Параметры.Источник.Товары.Итог(""СуммаНДС"");");
	
	// Таблица Стороны
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.ДоступенФункционалВерсииСервиса("2.1.28.12.CORP") Тогда
		ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
			Правило,
			Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
			"partyRows.rows",
			"Параметры.Результат = Новый ТаблицаЗначений;
			|Параметры.Результат.Колонки.Добавить(""Комментарий"");
			|Параметры.Результат.Колонки.Добавить(""КонтактноеЛицо"");
			|Параметры.Результат.Колонки.Добавить(""Наименование"");
			|Параметры.Результат.Колонки.Добавить(""НаименованиеID"");
			|Параметры.Результат.Колонки.Добавить(""НаименованиеТип"");
			|Параметры.Результат.Колонки.Добавить(""Сторона"");
			|Параметры.Результат.Колонки.Добавить(""Установил"");
			|Параметры.Результат.Колонки.Добавить(""ДатаПодписи"");
			|Параметры.Результат.Колонки.Добавить(""Подписан"");
			|Параметры.Результат.Колонки.Добавить(""Подписал"");
			|
			|НоваяСтрока = Параметры.Результат.Добавить();
			|НоваяСтрока.Сторона = Параметры.Источник.Организация;
			|НаименованиеПродавецXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПредопределенноеЗначениеДО(
			|	""DMPartyName"", ""Продавец"");
			|НоваяСтрока.Наименование = НаименованиеПродавецXDTO.name;
			|НоваяСтрока.НаименованиеID = НаименованиеПродавецXDTO.objectID.id;
			|НоваяСтрока.НаименованиеТип = НаименованиеПродавецXDTO.objectID.type;
			|
			|НоваяСтрока = Параметры.Результат.Добавить();
			|НоваяСтрока.Сторона = Параметры.Источник.Контрагент;
			|НаименованиеПокупательXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПредопределенноеЗначениеДО(
			|	""DMPartyName"", ""Покупатель"");
			|НоваяСтрока.Наименование = НаименованиеПокупательXDTO.name;
			|НоваяСтрока.НаименованиеID = НаименованиеПокупательXDTO.objectID.id;
			|НоваяСтрока.НаименованиеТип = НаименованиеПокупательXDTO.objectID.type;
			|Если ЗначениеЗаполнено(Параметры.Источник.КонтактноеЛицо) Тогда
			|	НоваяСтрока.КонтактноеЛицо = Параметры.Источник.КонтактноеЛицо;
			|КонецЕсли;");
	КонецЕсли;
	
	//////////////////////////////////////////////////////
	// Правила загрузки (Получение из 1С:Документооборота)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"СуммаДокумента",
		"sum",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"ЦенаВключаетНДС",
		Истина,
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.Запрещено);
	
	//////////////////////////////////////////////////////
	// Парные правила
	
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Валюта",
		"currency",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Менеджер",
		"responsible",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"КонтактноеЛицо",
		"contactPerson",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"СрокДействия",
		"performanceDate",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	
	// Таблица "Товары и услуги" - "Товары"
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Товары",
		"productRows.rows",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Номенклатура",
		"product",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Цена",
		"price",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Количество",
		"quantity",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"ЕдиницаИзмерения",
		"measurementUnit",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"СуммаНДС",
		"VAT",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Сумма",
		"total",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	
	// Ставка НДС в загрузке и выгрузке будет заполняться по-разному
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"VATRate",
		"Товары.СтавкаНДС",
		Истина,,
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"СтавкаНДС",
		Справочники.СтавкиНДС.БезНДС,
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары");
	
	//////////////////////////////////////////////////////
	// Печатные формы
	НоваяСтрока = Правило.ПрисоединяемыеПечатныеФормы.Добавить();
	НоваяСтрока.ИмяКоманды = "КоммерческоеПредложениеКлиенту";
	НоваяСтрока.МенеджерПечати = "Документ.КоммерческоеПредложениеКлиенту";
	НоваяСтрока.Обновлять = Истина;
	НоваяСтрока.ПредставлениеКоманды = НСтр("ru = 'Коммерческое предложение клиенту (со скидками)'");
	
КонецПроцедуры

Процедура ДополнитьПравилоИнтеграцииЗаказКлиента(ПравилаИнтеграцииМенеджер, Правило)
	
	//////////////////////////////////////////////////////
	// Правила выгрузки (Передача в 1С:Документооборот)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"author",
		"Менеджер");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"sum",
		"Если Параметры.Источник.ЦенаВключаетНДС Тогда
		|	Параметры.Результат = Параметры.Источник.СуммаДокумента;
		|Иначе
		|	Параметры.Результат = Параметры.Источник.СуммаДокумента - Параметры.Источник.Товары.Итог(""СуммаНДС"");
		|КонецЕсли;");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"VAT",
		"Параметры.Результат = Параметры.Источник.Товары.Итог(""СуммаНДС"");");
	
	//////////////////////////////////////////////////////
	// Правила загрузки (Получение из 1С:Документооборота)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"СуммаДокумента",
		"sum",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"ЦенаВключаетНДС",
		Истина,
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.Запрещено);
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Согласован",
		"statusApproval",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	
	//////////////////////////////////////////////////////
	// Парные правила
	
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Валюта",
		"currency",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Менеджер",
		"responsible",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Подразделение",
		"subdivision",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"КонтактноеЛицо",
		"contactPerson",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения);
	
	// Таблица "Товары и услуги" - "Товары"
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Товары",
		"productRows.rows",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Номенклатура",
		"product",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Цена",
		"price",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Количество",
		"quantity",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"СуммаНДС",
		"VAT",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Сумма",
		"total",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	
	// Ставка НДС в загрузке и выгрузке будет заполняться по-разному
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"VATRate",
		"Товары.СтавкаНДС",
		Истина,,
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"СтавкаНДС",
		Справочники.СтавкиНДС.БезНДС,
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары");
	
	// Также нужно заполнить Количество упаковок
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"КоличествоУпаковок",
		"productRows.rows.quantity",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары");
	
	//////////////////////////////////////////////////////
	// Печатные формы
	НоваяСтрока = Правило.ПрисоединяемыеПечатныеФормы.Добавить();
	НоваяСтрока.ИмяКоманды = "ЗаказКлиента";
	НоваяСтрока.МенеджерПечати = "Обработка.ПечатьЗаказовНаТоварыУслуги";
	НоваяСтрока.Обновлять = Истина;
	НоваяСтрока.ПредставлениеКоманды = НСтр("ru = 'Заказ клиента'");
	
КонецПроцедуры

Процедура ДополнитьПравилоИнтеграцииЗаказПоставщику(ПравилаИнтеграцииМенеджер, Правило)
	
	//////////////////////////////////////////////////////
	// Правила выгрузки (Передача в 1С:Документооборот)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"author",
		"Менеджер");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"sum",
		"Если Параметры.Источник.ЦенаВключаетНДС Тогда
		|	Параметры.Результат = Параметры.Источник.СуммаДокумента;
		|Иначе
		|	Параметры.Результат = Параметры.Источник.СуммаДокумента - Параметры.Источник.Товары.Итог(""СуммаНДС"");
		|КонецЕсли;");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"VAT",
		"Параметры.Результат = Параметры.Источник.Товары.Итог(""СуммаНДС"");");
	
	//////////////////////////////////////////////////////
	// Правила загрузки (Получение из 1С:Документооборота)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"СуммаДокумента",
		"sum",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"ЦенаВключаетНДС",
		Истина,
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.Запрещено);
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Согласован",
		"statusApproval",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	
	//////////////////////////////////////////////////////
	// Парные правила
	
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Валюта",
		"currency",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Менеджер",
		"responsible",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Подразделение",
		"subdivision",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"КонтактноеЛицо",
		"contactPerson",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения);
	
	// Таблица "Товары и услуги" - "Товары"
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Товары",
		"productRows.rows",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Номенклатура",
		"product",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Цена",
		"price",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Количество",
		"quantity",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"СуммаНДС",
		"VAT",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Сумма",
		"total",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары",
		"productRows.rows");
	
	// Ставка НДС в загрузке и выгрузке будет заполняться по-разному
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"VATRate",
		"Товары.СтавкаНДС",
		Истина,,
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"СтавкаНДС",
		Справочники.СтавкиНДС.БезНДС,
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары");
	
	// Также нужно заполнить Количество упаковок
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"КоличествоУпаковок",
		"productRows.rows.quantity",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"Товары");
	
	//////////////////////////////////////////////////////
	// Печатные формы
	НоваяСтрока = Правило.ПрисоединяемыеПечатныеФормы.Добавить();
	НоваяСтрока.ИмяКоманды = "ЗаказПоставщику";
	НоваяСтрока.МенеджерПечати = "Обработка.ПечатьЗаказовНаТоварыУслуги";
	НоваяСтрока.Обновлять = Истина;
	НоваяСтрока.ПредставлениеКоманды = НСтр("ru = 'Заказ поставщику'");
	
КонецПроцедуры

Процедура ДополнитьПравилоИнтеграцииЗаявкаНаВозвратТоваровОтКлиента(ПравилаИнтеграцииМенеджер, Правило)
	
	//////////////////////////////////////////////////////
	// Правила выгрузки (Передача в 1С:Документооборот)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"author",
		"Менеджер");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"sum",
		"Если Параметры.Источник.ЦенаВключаетНДС Тогда
		|	Параметры.Результат = Параметры.Источник.СуммаДокумента;
		|Иначе
		|	Параметры.Результат = Параметры.Источник.СуммаДокумента - Параметры.Источник.ВозвращаемыеТовары.Итог(""СуммаНДС"");
		|КонецЕсли;");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"VAT",
		"Параметры.Результат = Параметры.Источник.ВозвращаемыеТовары.Итог(""СуммаНДС"");");
	
	//////////////////////////////////////////////////////
	// Правила загрузки (Получение из 1С:Документооборота)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"СуммаДокумента",
		"sum",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"ЦенаВключаетНДС",
		Истина,
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.Запрещено);
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Согласован",
		"statusApproval",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	
	//////////////////////////////////////////////////////
	// Парные правила
	
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Валюта",
		"currency",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Менеджер",
		"responsible",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Подразделение",
		"subdivision",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"КонтактноеЛицо",
		"contactPerson",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"ЖелаемаяДатаПоступления",
		"performanceDate",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	
	// Таблица "Товары и услуги" - "Возвращаемые товары"
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"ВозвращаемыеТовары",
		"productRows.rows",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Номенклатура",
		"product",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"ВозвращаемыеТовары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Цена",
		"price",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"ВозвращаемыеТовары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Количество",
		"quantity",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"ВозвращаемыеТовары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"СуммаНДС",
		"VAT",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"ВозвращаемыеТовары",
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Сумма",
		"total",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"ВозвращаемыеТовары",
		"productRows.rows");
	
	// Ставка НДС в загрузке и выгрузке будет заполняться по-разному
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"VATRate",
		"ВозвращаемыеТовары.СтавкаНДС",
		Истина,,
		"productRows.rows");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение,
		"СтавкаНДС",
		Справочники.СтавкиНДС.БезНДС,
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"ВозвращаемыеТовары");
	
	// Также нужно заполнить Количество упаковок
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"КоличествоУпаковок",
		"productRows.rows.quantity",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"ВозвращаемыеТовары");
	
	//////////////////////////////////////////////////////
	// Печатные формы
	НоваяСтрока = Правило.ПрисоединяемыеПечатныеФормы.Добавить();
	НоваяСтрока.ИмяКоманды = "ЗаявкаНаВозврат";
	НоваяСтрока.МенеджерПечати = "Документ.ЗаявкаНаВозвратТоваровОтКлиента";
	НоваяСтрока.Обновлять = Истина;
	НоваяСтрока.ПредставлениеКоманды = НСтр("ru = 'Заявка на возврат'");
	
КонецПроцедуры

Процедура ДополнитьПравилоИнтеграцииЗаявкаНаРасходованиеДенежныхСредств(ПравилаИнтеграцииМенеджер, Правило)
	
	//////////////////////////////////////////////////////
	// Правила выгрузки (Передача в 1С:Документооборот)
	
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"author",
		"КтоЗаявил");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"VAT",
		"Параметры.Результат = Параметры.Источник.РасшифровкаПлатежа.Итог(""СуммаНДС"");");
	
	// Таблица Статьи ДДС
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаДО(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке,
		"cashFlowRows.rows",
		"Параметры.Результат = Новый ТаблицаЗначений;
		|Параметры.Результат.Колонки.Добавить(""СтатьяДДС"");
		|Параметры.Результат.Колонки.Добавить(""Сумма"");
		|Параметры.Результат.Колонки.Добавить(""СуммаНДС"");
		|Для Каждого Строка Из Параметры.Источник.РасшифровкаПлатежа Цикл
		|	НоваяСтрока = Параметры.Результат.Добавить();
		|	НоваяСтрока.СтатьяДДС = Строка.СтатьяДвиженияДенежныхСредств;
		|	НоваяСтрока.Сумма = Строка.Сумма;
		|	НоваяСтрока.СуммаНДС = Строка.СуммаНДС;
		|КонецЦикла;
		|Параметры.Результат.Свернуть(""СтатьяДДС"", ""Сумма, СуммаНДС"")");
	
	//////////////////////////////////////////////////////
	// правила загрузки (Получение из 1С:Документооборота)
	
	// Таблица "Статьи движения денежных средств" - "Расшифровка платежа"
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"РасшифровкаПлатежа",
		"cashFlowRows.rows",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"СтатьяДвиженияДенежныхСредств",
		"cashFlowRows.rows.item",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"РасшифровкаПлатежа");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"Сумма",
		"cashFlowRows.rows.total",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"РасшифровкаПлатежа");
	ПравилаИнтеграцииМенеджер.ДобавитьПравилоЗаполненияРеквизитаИС(
		Правило,
		Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта,
		"СуммаНДС",
		"cashFlowRows.rows.VAT",
		Ложь,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением,
		"РасшифровкаПлатежа");
	
	//////////////////////////////////////////////////////
	// Парные правила
	
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональность.ДоступенФункционалВерсииСервиса("2.1.28.12.CORP") Тогда
		ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
			Правило,
			"Контрагент",
			"recipient",,,
			Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	КонецЕсли;
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"СуммаДокумента",
		"sum",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Валюта",
		"currency",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"КтоЗаявил",
		"responsible",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноБезПерепроведения);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"Подразделение",
		"subdivision",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	ПравилаИнтеграцииМенеджер.ДобавитьПарноеПравило(
		Правило,
		"ЖелательнаяДатаПлатежа",
		"performanceDate",,,
		Перечисления.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота.РазрешеноСПерепроведением);
	
КонецПроцедуры

#КонецОбласти
